Service - Income Tax/archive/2022/sample messages/file_request_ir4_standalone.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <r4:fileRequest xmlns:r4="urn:www.ird.govt.nz/GWS:types/ReturnIR4.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <rc:fileHeader xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">096062311</cmn:identifier>
                            <cmn:accountType>INC</cmn:accountType>
                            <rc:periodEndDate>2022-03-31</rc:periodEndDate>
                            <rc:majorFormType>INC</rc:majorFormType>
                            <rc:minorFormType>4</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>false</rc:isAmended>
                                    <rc:amendReason/>
                                    <rc:amendDetails/>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r4:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ic="urn:www.ird.govt.nz/GWS:types/IncomeReturnCommon.v1">
                                <r4:nonResidentIndicator>false</r4:nonResidentIndicator>
                                <r4:schedularPayments>
                                    <ic:withholdingTaxDeducted>1000.00</ic:withholdingTaxDeducted>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r4:schedularPayments>
                                <r4:interestIncome>
                                    <ic:totalTaxPaid>1000.00</ic:totalTaxPaid>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r4:interestIncome>
                                <r4:pieIncome>
                                    <ic:totalTaxCredits>1000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r4:pieIncome>
                                <r4:dividendIncome>
                                    <ic:totalImputationCredits>280.00</ic:totalImputationCredits>
                                    <ic:totalRWTCredits>0.00</ic:totalRWTCredits>
                                    <ic:totalGrossDividends>1000.00</ic:totalGrossDividends>
                                </r4:dividendIncome>
                                <r4:maoriAuthorityDistributions>
                                    <ic:totalMACredits>1000.00</ic:totalMACredits>
                                    <ic:totalMADistributions>1000.00</ic:totalMADistributions>
                                </r4:maoriAuthorityDistributions>
                                <r4:partnershipEstateTrustIncome>
                                    <ic:totalTaxCredits>1000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r4:partnershipEstateTrustIncome>
                                <r4:totalTaxCredits>5000.00</r4:totalTaxCredits>
                                <r4:overseasIncome>
                                    <ic:totalTaxPaid>0.00</ic:totalTaxPaid>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r4:overseasIncome>
                                <r4:residentialRentalIncome>
                                    <ic:indicator>I</ic:indicator>
                                    <ic:totalIncome>1100.00</ic:totalIncome>
                                    <ic:residentialRentalDeductions>1000.00</ic:residentialRentalDeductions>
                                    <ic:excessDeductionsBroughtForward>0.00</ic:excessDeductionsBroughtForward>
                                    <ic:deductionsClaimedThisYear>1000.00</ic:deductionsClaimedThisYear>
                                    <ic:netIncome>1100.00</ic:netIncome>
                                    <ic:excessDeductionsCarriedForward>0.00</ic:excessDeductionsCarriedForward>
                                </r4:residentialRentalIncome>
                                <r4:propertyInterestLimitation>
                                    <ic:totalInterest>0.00</ic:totalInterest>
                                    <ic:interestExpenseClaimed>0.00</ic:interestExpenseClaimed>
                                    <ic:interestExpenseClaimedReason>
                                        <ic:notResidentialOrMaoriExempt>false</ic:notResidentialOrMaoriExempt>
                                        <ic:propertyNotInNz>false</ic:propertyNotInNz>
                                        <ic:loansDrawnDown>false</ic:loansDrawnDown>
                                        <ic:newBuildExemption>false</ic:newBuildExemption>
                                        <ic:developmentExemption>false</ic:developmentExemption>
                                        <ic:emergencyTransitionalSocialCouncil>false</ic:emergencyTransitionalSocialCouncil>
                                    </ic:interestExpenseClaimedReason>
                                </r4:propertyInterestLimitation>
                                <r4:businessOrRentalIncome>1000.00</r4:businessOrRentalIncome>
                                <r4:totalGrossPremium>0.00</r4:totalGrossPremium>
                                <r4:totalGrossPremiumPaidToSwitzerland>0.00</r4:totalGrossPremiumPaidToSwitzerland>
                                <r4:totalTaxablePremium>0.00</r4:totalTaxablePremium>
                                <r4:otherIncome>1000.00</r4:otherIncome>
                                <r4:rlwtCredit>0.00</r4:rlwtCredit>
                                <r4:saleOfProperty>1000.00</r4:saleOfProperty>
                                <r4:donationsMade>1000.00</r4:donationsMade>
                                <r4:lossesBroughtForward>5000</r4:lossesBroughtForward>
                                <r4:lossesClaimedThisYear>5000</r4:lossesClaimedThisYear>
                                <r4:lossContinuity>true</r4:lossContinuity>
                                <r4:lossCarriedBackPriorYear>0.00</r4:lossCarriedBackPriorYear>
                                <r4:netLossesToFrom>0.00</r4:netLossesToFrom>
                                <r4:subventionPaymentsToFrom>0.00</r4:subventionPaymentsToFrom>
                                <r4:totalTaxableIncome>9000.00</r4:totalTaxableIncome>
                                <r4:taxOnTaxableIncome>2520.00</r4:taxOnTaxableIncome>
                                <r4:researchAndDevelopment>
                                    <ic:creditBroughtForward>0.00</ic:creditBroughtForward>
                                    <ic:nonrefundableCredit>0.00</ic:nonrefundableCredit>
                                    <ic:refundableCredit>0.00</ic:refundableCredit>
                                </r4:researchAndDevelopment>
                                <r4:foreignInvestorTaxCredit>1000.00</r4:foreignInvestorTaxCredit>
                                <r4:residualIncomeTax>-3760.00</r4:residualIncomeTax>
                                <r4:provisionalTax>
                                    <ic:provisionalTaxOption>STD</ic:provisionalTaxOption>
                                    <ic:provisionalTaxPayable>1000</ic:provisionalTaxPayable>
                                    <ic:provisionalTaxStartDate>2017-01-01</ic:provisionalTaxStartDate>
                                </r4:provisionalTax>
                                <r4:paymentsMadeToNonResidents>false</r4:paymentsMadeToNonResidents>
                                <r4:withholdingTaxDeducted>false</r4:withholdingTaxDeducted>
                                <r4:foreignIncomeDisclosure>false</r4:foreignIncomeDisclosure>
                                <r4:repurchasedRedeemedCancelledShares>1000.00</r4:repurchasedRedeemedCancelledShares>
                                <r4:foreignSourcedDividends>false</r4:foreignSourcedDividends>
                                <r4:foreignControlIndicator>false</r4:foreignControlIndicator>
                                <r4:lowestEconomicShareholderInterest>1000.00</r4:lowestEconomicShareholderInterest>
                                <r4:shareholderDetails>
                                    <ic:shareholder>
                                        <ic:irdNumber>132311501</ic:irdNumber>
                                        <ic:remuneration>0</ic:remuneration>
                                        <ic:loansFromCompany>1000.00</ic:loansFromCompany>
                                        <ic:currentAccountBalance>1000.00</ic:currentAccountBalance>
                                        <ic:shareholderLossOffsets>0.00</ic:shareholderLossOffsets>
                                        <ic:subventionPayments>0</ic:subventionPayments>
                                    </ic:shareholder>
                                </r4:shareholderDetails>
                            </rc:formFields>
                        </rc:fileBody>
                    </r4:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>